app/controllers/bookmarks_controller.rb

SELECT `bookmarks`.* FROM `bookmarks`
---
  def index
    @bookmarks = Bookmark.all

INSERT INTO `bookmarks` (`name`, `content`, `usuario_id`, `created_at`, `updated_at`) VALUES ('VMware', 'www.vmware.com', 0, '2015-05-21 01:46:54', '2015-05-21 01:46:54')
---
  def create
    @bookmark = Bookmark.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save

SELECT  `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 4 LIMIT 1
---
    def set_bookmark
      @bookmark = Bookmark.find(params[:id])