app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO `usuarios` (`name`, `about`, `created_at`, `updated_at`) VALUES ('Lino Estela', 'Paginas de sistemas', '2015-05-21 01:46:05', '2015-05-21 01:46:05')

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1